app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."title" = ? LIMIT 1  [["title", "7"]]
---
  def search
    @similar_movies = Movie.similar_movies(params[:title])
    if @similar_movies.nil?
      flash[:notice] = "'#{params[:title]}' has no director info"
      redirect_to root_url
    end
    @movie = Movie.find_by(title: params[:title])

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "movies" SET "title" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "Ridley Scott"], ["updated_at", "2022-10-26 22:34:10.016433"], ["id", 3]]
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)